trunk/app/controllers/users_controller.rb

INSERT INTO "users" ("updated_at", "firstname", "lastname", "usertype", "password", "email", "created_at") VALUES('2010-04-03 19:04:10', 'Tweedle', 'Dee', 'admin', 'candy', 'tweedledee@disney.com', '2010-04-03 19:04:10')
---
  def create
    if session[:adminuser]
      @user = User.new(params[:user])
      @user.password = params[:password]
      @user.email = params[:email]
      @user.usertype = params[:usertype]
      @user.save!

SELECT * FROM "users" WHERE ("users"."id" = 2)
UPDATE "users" SET "password" = '23456', "updated_at" = '2010-04-07 20:45:43' WHERE "id" = 2
---
  def update
    @user = User.find(params[:id])

    respond_to do |format|
      if @user.update_attributes(params[:user])