app/controllers/users_controller.rb

SELECT * FROM "users" WHERE ("users"."id" = 5)
---
  def show
    if (session[:id].to_s == params[:id].to_s) || session[:adminuser]
      @user = User.find(params[:id])

INSERT INTO "users" ("updated_at", "firstname", "lastname", "usertype", "password", "email", "created_at") VALUES('2010-04-03 19:04:10', 'Tweedle', 'Dee', 'admin', 'candy', 'tweedledee@disney.com', '2010-04-03 19:04:10')
---
  def create
    if session[:adminuser]
      @user = User.new(params[:user])
      @user.password = params[:password]
      @user.email = params[:email]
      @user.usertype = params[:usertype]
      @user.save!

SELECT * FROM "users" WHERE ("users"."id" = 6)
---
  def edit
    if (session[:id].to_s == params[:id].to_s) || session[:adminuser]
      @user = User.find(params[:id])